package com.batyrov.ps.util;

import java.util.List;
import java.util.Vector;

/**
 * Created by IntelliJ IDEA.
 * User: sulic
 * Date: 16.03.2008
 * Time: 19:21:47
 * To change this template use File | Settings | File Templates.
 */
public class Region {


    public static List getRegions(){
        List list  = new Vector();
        for (int i = 0; i<regionValues.length;i++){
            Region m = new Region();
            m.key =  regionKeys[i];
            m.value = regionValues[i];
            list.add(m);
        }
        return list;
    }


    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }

    public String getKey() {
        return key;
    }

    public void setKey(String key) {
        this.key = key;
    }

    public static String[] getRegionKeys() {
        return regionKeys;
    }

    public static void setRegionKeys(String[] regionKeys) {
        Region.regionKeys = regionKeys;
    }

    public static String[] getRegionValues() {
        return regionValues;
    }

    public static void setRegionValues(String[] regionValues) {
        Region.regionValues = regionValues;
    }

    private String value;
    private String key;

    private static String[] regionKeys = {
            "77",
            "78",
            "80",
            "01",
            "04",
            "22",
            "28",
            "29",
            "30",
            "99",
            "02",
            "31",
            "32",
            "03",
            "33",
            "34",
            "35",
            "36",
            "05",
            "79",
            "37",
            "06",
            "38",
            "07",
            "39",
            "08",
            "40",
            "41",
            "09",
            "10",
            "42",
            "43",
            "11",
            "81",
            "82",
            "44",
            "23",
            "24",
            "45",
            "46",
            "47",
            "48",
            "49",
            "12",
            "13",
            "50",
            "51",
            "83",
            "52",
            "53",
            "54",
            "55",
            "56",
            "57",
            "58",
            "59",
            "25",
            "60",
            "61",
            "62",
            "63",
            "64",
            "14",
            "65",
            "66",
            "15",
            "67",
            "26",
            "84",
            "68",
            "16",
            "69",
            "70",
            "71",
            "17",
            "72",
            "18",
            "73",
            "85",
            "27",
            "19",
            "86",
            "74",
            "20",
            "75",
            "21",
            "87",
            "88",
            "89",
            "76"
    };
    private static String[] regionValues = {
            "г Москва",
            "г Санкт-Петербург",
            "Агинский Бурятский АО",
            "Респ Адыгея",
            "Респ Алтай",
            "Алтайский край",
            "Амурская обл",
            "Архангельская обл",
            "Астраханская обл",
            "г Байконур",
            "Респ Башкортостан",
            "Белгородская обл",
            "Брянская обл",
            "Респ Бурятия",
            "Владимирская обл",
            "Волгоградская обл",
            "Вологодская обл",
            "Воронежская обл",
            "Респ Дагестан",
            "Еврейская Аобл",
            "Ивановская обл",
            "Респ Ингушетия",
            "Иркутская обл",
            "Респ Кабардино-Балкарская",
            "Калининградская обл",
            "Респ Калмыкия",
            "Калужская обл",
            "Камчатская обл",
            "Респ Карачаево-Черкесская",
            "Респ Карелия",
            "Кемеровская обл",
            "Кировская обл",
            "Респ Коми",
            "Коми-Пермяцкий АО",
            "Корякский АО",
            "Костромская обл",
            "Краснодарский край",
            "Красноярский край",
            "Курганская обл",
            "Курская обл",
            "Ленинградская обл",
            "Липецкая обл",
            "Магаданская обл",
            "Респ Марий Эл",
            "Респ Мордовия",
            "Московская обл",
            "Мурманская обл",
            "Ненецкий АО",
            "Нижегородская обл",
            "Новгородская обл",
            "Новосибирская обл",
            "Омская обл",
            "Оренбургская обл",
            "Орловская обл",
            "Пензенская обл",
            "Пермская обл",
            "Приморский край",
            "Псковская обл",
            "Ростовская обл",
            "Рязанская обл",
            "Самарская обл",
            "Саратовская обл",
            "Респ Саха (Якутия)",
            "Сахалинская обл",
            "Свердловская обл",
            "Респ Северная Осетия - Алания",
            "Смоленская обл",
            "Ставропольский край",
            "Таймырский АО",
            "Тамбовская обл",
            "Респ Татарстан",
            "Тверская обл",
            "Томская обл",
            "Тульская обл",
            "Респ Тыва",
            "Тюменская обл",
            "Респ Удмуртская",
            "Ульяновская обл",
            "Усть-Ордынский Бурятский АО",
            "Хабаровский край",
            "Респ Хакасия",
            "Ханты-Мансийский - Югра АО",
            "Челябинская обл",
            "Респ Чеченская",
            "Читинская обл",
            "Респ Чувашская - Чувашия",
            "Чукотский АО",
            "Эвенкийский АО",
            "Ямало-Ненецкий АО",
            "Ярославская обл"
    };

}
